# 2.1 - Queries publications db

### caso select everything
```mysql
select * from publishers;
```

### caso where
```mysql
select * from publishers where city='Boston' or city='Chicago';
select * from publishers where country='USA';
```

### misma query con IN
```mysql
select * from publishers where city in ('Boston', 'Chicago');
```

### ejemplo join
```mysql
select * from titles as t
left join titleauthor as a
on t.title_id=a.title_id;
```

### lo mismo
```mysql
select * from titles 
left join titleauthor 
on titles.title_id=titleauthor.title_id;
```

### otro ejemplo join
```mysql
select title, title_id
from titles as title
left join
titleauthor as author 
on title_id = title_id;
```

### concat y doble join
```mysql
select t.title, t.title_id, a.au_id, concat(au.au_fname, ' ', au.au_lname) as completename
from titles as t
left join titleauthor as a
on t.title_id=a.title_id
left join authors as au
on a.au_id=au.au_id;
```

### libros con autores y año
```mysql
select title, year(max(pubdate)) as 'year', count(titleauthor.title_id) as numauthors,
group_concat(concat(authors.au_fname, ' ', authors.au_lname)) as allauthors
from titles
left join titleauthor
on titles.title_id=titleauthor.title_id
left join authors
on authors.au_id=titleauthor.au_id
group by titles.title
order by numauthors desc;
```

### otro ejemplo 
```mysql
select *
from publications.employee emp
right join publications.jobs job
on emp.job_id=job.job_id
union
select *
from publications.employee emp
left join publications.jobs job
on emp.job_id=job.job_id;
```

### libros con autor
```mysql
select t.title, t.title_id, a.au_id, CONCAT(au.au_fname, ' ', au.au_lname) as completename
from titles as t
left join titleauthor as a
on t.title_id = a.title_id
left join authors as au
on a.au_id = au.au_id;
```

### libros con nombre completo del autor y año
```mysql
select title,  year(max(pubdate)) as "year", count(titleauthor.title_id) as numautores, 
group_concat(concat(authors.au_fname,' ', authors.au_lname))
from titles
left join titleauthor
on titles.title_id = titleauthor.title_id
left join authors
on authors.au_id = titleauthor.au_id
group by titles.title
order by numautores desc;
```

### Union
```mysql
select  au_id, city as m from authors where state="IN"
union
select au_id, royaltyper as m from  titleauthor;
```

### Subquery
```mysql
select stor_id, m.title, m.title_id, payterms  
from sales 
inner join titles as m on sales.title_id = m.title_id
where payterms != "Net 30" and  m.title_id in (
    
		select titles.title_id from sales 
		inner join titles on sales.title_id = titles.title_id
		where payterms = "Net 30"
    
	);
```